regtests/soap4.out

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
<soap:Body>
<awsns:Arr_Rec xmlns:awsns="http://soapaws/">
<arr soapenc:arrayType="awsns:rec[3]" xsi:type="soapenc:Array">
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
</arr>
</awsns:Arr_Rec>
</soap:Body>
</soap:Envelope>


<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
<soap:Body>
<awsns:Arr_Rec2 xmlns:awsns="http://soapaws/">
<arr2 soapenc:arrayType="xsd:ur-type[4]" xsi:type="soapenc:Array">
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec2>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec2>
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
</arr2>
</awsns:Arr_Rec2>
</soap:Body>
</soap:Envelope>


<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
<soap:Body>
<awsns:Arr_Rec3 xmlns:awsns="http://soapaws/">
<arr3 soapenc:arrayType="xsd:ur-type[4]" xsi:type="soapenc:Array">
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
   <rec xsi:type="xsd:string">value</rec>
   <rec>
      <name1 xsi:type="xsd:string">val1</name1>
      <name2 xsi:type="xsd:string">val2</name2>
   </rec>
</arr3>
</awsns:Arr_Rec3>
</soap:Body>
</soap:Envelope>


